      const mbti = [
        'ENTJ',
        'ENTP',
        'INTJ',
        'INTP',
        'ESTJ',
        'ESFJ',
        'ISTJ',
        'ISFJ',
        'ENFJ',
        'ENFP',
        'INFJ',
        'INFP',
        'ESTP',
        'ESFP',
        'ISTP',
        'ISFP',
      ];
      const result = [
        [5, 4, 3, 3, 4, 5, 4, 5, 4, 3, 3, 1, 2, 2, 3, 1],
        [4, 2, 3, 3, 2, 2, 1, 1, 3, 4, 3, 3, 4, 5, 4, 5],
        [3, 3, 3, 4, 4, 5, 3, 5, 3, 3, 3, 2, 1, 1, 3, 2],
        [3, 3, 4, 3, 2, 1, 3, 1, 1, 3, 2, 4, 4, 5, 4, 5],
        [4, 2, 4, 2, 3, 4, 3, 3, 5, 3, 5, 1, 5, 3, 3, 5],
        [5, 2, 5, 1, 4, 3, 3, 3, 3, 2, 4, 3, 3, 4, 1, 3],
        [4, 1, 3, 3, 3, 3, 3, 4, 5, 1, 5, 2, 3, 3, 4, 2],
        [5, 1, 5, 1, 3, 3, 4, 4, 4, 1, 4, 3, 3, 3, 2, 5],
        [4, 3, 3, 1, 5, 3, 5, 4, 2, 4, 3, 3, 2, 2, 1, 3],
        [3, 4, 3, 3, 2, 2, 1, 1, 4, 3, 3, 4, 5, 5, 5, 3],
        [3, 3, 3, 2, 5, 4, 5, 4, 3, 3, 3, 5, 1, 1, 1, 3],
        [1, 3, 2, 4, 1, 3, 2, 3, 3, 4, 5, 3, 5, 4, 4, 4],
        [2, 4, 1, 4, 5, 3, 3, 3, 2, 5, 1, 5, 3, 4, 3, 3],
        [2, 5, 1, 5, 3, 4, 3, 3, 2, 5, 1, 4, 4, 4, 3, 3],
        [3, 4, 3, 4, 3, 1, 4, 2, 1, 5, 1, 5, 3, 3, 4, 4],
        [1, 5, 2, 5, 1, 3, 2, 5, 3, 3, 3, 4, 3, 3, 4, 3],
      ];
      const resultResource = [
        {
          text: '🥰 이상적인 관계 (100% 궁합) 🥰 ',
          description: '문제가 잘 해결되고 관계가 자연스럽게 발전되요!',
          img: 'https://item.kakaocdn.net/do/e975735e0903c503b54244091e591e1a71b950f0a05bd8dba8b11dbe535ebe4b',
        },
        {
          text: '😘 끈끈한 관계 (80% 궁합) 😘 ',
           description: '어려움이 있을 수 있지만 타협점을 찾을 수 있어요!',
          img: 'https://item.kakaocdn.net/do/8bcced03ee1a17861a790740579f482c82f3bd8c9735553d03f6f982e10ebe70',
        },
        {
          text: '🙂 잠재적 관계 (60% 궁합) 🙂 ',
          description: '끈끈한 관계를 위해서는 서로의 가치에 변화를 찾아야해요!',
          img: 'https://item.kakaocdn.net/do/5c207ae8e319d5e187ed229a5827aad98f324a0b9c48f77dbce3a43bd11ce785',
        },
        {
          text: '😤 갈등 관계 (40% 궁합) 😤 ',
          description: '서로 타협하고 성숙해져야 유지될 수 있어요!',
          img: 'https://item.kakaocdn.net/do/0c5d8e3d0f5a44781ef255a1735482b1ac8e738cb631e72fdb9a96b36413984e',
        },
        {
          text: '😖 맞지않는 관계 (20% 궁합) 😖 ',
          description: '두 사람 모두가 양보해야하고 공감이 필요해요!',
          img: 'https://item.kakaocdn.net/do/5c207ae8e319d5e187ed229a5827aad982f3bd8c9735553d03f6f982e10ebe70',
        },
      ];
      
     